app/controllers/admin/projects_controller.rb

UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "testing edit"], ["updated_at", "2016-04-29 22:27:27.358720"], ["id", 1]]
---
  def update
    if @project.update(project_params)