app/views/projects/show.html.erb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ?  [["project_id", 1]]
---
  <tbody>
    <% @project.tickets.each do |ticket| %>