app/controllers/projects_controller.rb

UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "testing edit"], ["updated_at", "2016-04-21 14:15:03.120303"], ["id", 1]]
---
  def update
    if @project.update(project_params)