app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("title", "description", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Houston"], ["description", "We have a problem"], ["project_id", 1], ["created_at", "2016-04-21 18:23:21.697326"], ["updated_at", "2016-04-21 18:23:21.697326"]]
---
  def create
    @ticket = @project.tickets.build(ticket_params)

    if @ticket.save

UPDATE "tickets" SET "title" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["title", "updated title"], ["updated_at", "2016-04-22 15:12:13.389081"], ["id", 1]]
---
  def update
    if @ticket.update(ticket_params)